БухЭксп/Catalogs/CW_Заказы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_Заказы</Name>
			<Comment>Заказы</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.CW_Заявки</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаСделкиФ</Name>
					<Comment>Дата сделки (фактическая)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Comment>Клиент</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МенеджерПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперативныйМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Груз</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_МаршрутыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипыПеревозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийБюджета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коносамент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Коносаменты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтрагентыПоБюджету</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыЗаказа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПлан</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеФакт</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеДанных</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВладельца</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыПараметровЗаказа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВедущего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторыВедомых</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Раскрывать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторГруппы</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВладельца</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порядок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ПраваДоступаДляПараметровМониторинга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ПраваДоступаДляПараметровМониторинга</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Просмотр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Редактирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ХарактеристикиЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ХарактеристикиЗаказов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранилищеДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторВладельца</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заказы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Catalogs/CW_Заказы/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
//Служебные процедуры
Процедура ОбновитьСписокНомеровЗакзаов() Экспорт
	
	Префикс = СокрЛП(Константы.CW_ПрефиксЗаказов.Получить());
	Если ЗначениеЗаполнено(Префикс) Тогда
		Если Найти(Префикс,"[") > 0 Тогда
			//Используются шабоны префикса, ничего не делаем, они уже пишутся в регистр
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_Заказы.Ссылка КАК Ссылка,
	               |	CW_Заказы.Код КАК Код
	               |ИЗ
	               |	Справочник.CW_Заказы КАК CW_Заказы
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Код УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ПоследнийНомер =  Выборка.код;
		РегистрыСведений.CW_НумерацияЗаказов.ЗаписатьПоследнийНомерЗаказа(Префикс, ПоследнийНомер);
	КонецЕсли;
	
КонецПроцедуры
//Служебные процедуры

Процедура ПроверитьСоответствиеРеквизитов(Заказ) Экспорт 
	// --- 
	
	ПроверятьСоответствие = CW_Настройки.ПолучитьНастройкуПользователя(,"ПроверятьСоответствиеРеквизитовЗаказаРеквизитамГрузоперевозок");
	Если (НЕ ПроверятьСоответствие) Тогда
		Возврат;
	КонецЕсли; 
	
	з = Новый Запрос(
		"ВЫБРАТЬ
		|	1 КАК ПолеСортировки,
		|	CW_Заказы.Ссылка,
		|	CW_Заказы.Код,
		|	CW_Заказы.Клиент,
		|	CW_Заказы.МенеджерПродаж,
		|	CW_Заказы.ОперативныйМенеджер,
		|	CW_Заказы.Груз,
		|	CW_Заказы.Маршрут
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	Справочник.CW_Заказы КАК CW_Заказы
		|ГДЕ
		|	CW_Заказы.Ссылка = &Заказ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	2,
		|	CW_Грузоперевозки.Ссылка,
		|	CW_Грузоперевозки.Код,
		|	CW_Грузоперевозки.Клиент,
		|	CW_Грузоперевозки.МенеджерПродаж,
		|	CW_Грузоперевозки.ОперативныйМенеджер,
		|	CW_Грузоперевозки.Груз,
		|	CW_Грузоперевозки.Маршрут
		|ИЗ
		|	Справочник.CW_Грузоперевозки КАК CW_Грузоперевозки
		|ГДЕ
		|	CW_Грузоперевозки.Заказ = &Заказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт.Клиент,
		|	вт.МенеджерПродаж,
		|	вт.ОперативныйМенеджер,
		|	вт.Груз,
		|	вт.Маршрут
		|ИЗ
		|	вт КАК вт
		|
		|СГРУППИРОВАТЬ ПО
		|	вт.Клиент,
		|	вт.МенеджерПродаж,
		|	вт.ОперативныйМенеджер,
		|	вт.Груз,
		|	вт.Маршрут"
	);
	з.УстановитьПараметр("Заказ", Заказ);
	з.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	рз = з.Выполнить();
	выб = рз.Выбрать();
	
	Если выб.Количество()=1 Тогда 
		// все реквизиты совпадают
	Иначе 
		
		текстСообщения = "Обнаружено различие в реквизитах между Заказом и Грузоперевозками:";
		
		// какие-то реквизиты отличаются
		з.Текст = "выбрать * ИЗ вт УПОРЯДОЧИТЬ ПО ПолеСортировки";
		тз = з.Выполнить().Выгрузить();
		
		// первая строка из заказа, остальные из грузоперевозок
		строкаЗаказ = тз[0];
		мдРеквизитыШапки = Метаданные.Справочники.CW_Грузоперевозки.Реквизиты;
		Для Каждого строкаТЗ Из тз Цикл
			Если ТипЗнч(строкаТЗ.Ссылка)=Тип("СправочникСсылка.CW_Заказы") Тогда 
				Продолжить;
			КонецЕсли;
			
			стр="";
			Для Каждого кол Из тз.Колонки Цикл
				Если Найти("Ссылка,Код,ПолеСортировки", кол.Имя)<>0 Тогда 
					Продолжить;
				КонецЕсли;
				Если строкаТЗ[кол.Имя]<>строкаЗаказ[кол.Имя] Тогда 
					стр = стр + ", " + мдРеквизитыШапки.Найти(кол.Имя).Синоним;
				КонецЕсли;
			КонецЦикла;
			
			Если НЕ ПустаяСтрока(стр) Тогда 
				текстСообщения = текстСообщения + Символы.ПС + " (" + строкаТЗ.Код + ") " +строкаТЗ.Ссылка + " - " + Сред(стр, 3);
			КонецЕсли;
			
		КонецЦикла;
		
		Сообщить(текстСообщения);
		
	КонецЕсли;
	
	
	// --- 
КонецПроцедуры


Процедура ПодключаемыеКоманды_ЗаполнитьБюджет(ПараметрыПроцедуры, АдресРезультата = Неопределено) Экспорт
	
	Обработка 	= _ПО.ПолучитьОбработку(ПараметрыПроцедуры.Обработка);
	Ответ 		= Обработка.ЗаполнитьБюджет(ПараметрыПроцедуры);
	
	ПоместитьВоВременноеХранилище(Ответ, АдресРезультата);

КонецПроцедуры

Функция ЗаполнитьНастройкиКолонок(ТипПеревозки=Неопределено) Экспорт
	
	Результат = Новый Массив;
	
	Структура = Новый Структура("Поле,Заголовок,ТипЗначения", "Ссылка", "Грузоперевозка", Новый ОписаниеТипов("СправочникСсылка.CW_Грузоперевозки"));
	Результат.Добавить(Структура);
	
	Для Каждого Реквизит из Метаданные.Справочники.CW_Грузоперевозки.Реквизиты Цикл
		Если Найти(Реквизит.Имя, "удалить") = 0 Тогда
			Структура = Новый Структура("Поле,Заголовок,ТипЗначения", "Ссылка." + Реквизит.Имя, Реквизит.Синоним, Реквизит.Тип);
			Результат.Добавить(Структура);
		КонецЕсли;	
	КонецЦикла;	
	
	ВыборкаПараметров = ПолучитьДоступныеПараметры(ТипПеревозки);
	Пока ВыборкаПараметров.Следующий() Цикл
		Структура = Новый Структура("Поле,Заголовок,ТипЗначения", "Ссылка.[" + ВыборкаПараметров.Идентификатор + "]", "Грузоперевозка." + ВыборкаПараметров.Идентификатор, ВыборкаПараметров.ТипЗначения);
		Результат.Добавить(Структура);
	КонецЦикла;	
	
	Возврат Результат;
	
КонецФункции	

Функция ПолучитьДоступныеПараметры(ТипПеревозки = Неопределено)
	
	МассивПараметров = Неопределено;
	Если ТипПеревозки <> Неопределено Тогда
		МассивПараметров = ТипПеревозки.ПараметрыГрузоперевозки.Выгрузить().ВыгрузитьКолонку("Параметр");
	КонецЕсли;
	
	ГруппаПользователя = CW_ПраваДоступа_ПИ.ГруппаПользователя(CW_Настройки.Пользователь());			
	Если ГруппаПользователя.ПолныеПрава Тогда
		ГруппаПользователя = Справочники.CW_ГруппыПользователей.Администраторы;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПараметрыГрузоперевозок.Ссылка КАК Параметр,
	               |	CW_ПараметрыГрузоперевозок.Идентификатор КАК Идентификатор,
	               |	CW_ПараметрыГрузоперевозок.ТипЗначения КАК ТипЗначения,
	               |	ВЫБОР
	               |		КОГДА &Группа = ЗНАЧЕНИЕ(Справочник.CW_ГруппыПользователей.Администраторы)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЕСТЬNULL(CW_ПраваДоступаДляПараметровМониторинга.Просмотр, ЛОЖЬ)
	               |	КОНЕЦ КАК Просмотр
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок КАК CW_ПараметрыГрузоперевозок
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ПраваДоступаДляПараметровМониторинга КАК CW_ПраваДоступаДляПараметровМониторинга
	               |		ПО (CW_ПраваДоступаДляПараметровМониторинга.Параметр = CW_ПараметрыГрузоперевозок.Ссылка)
	               |			И (CW_ПраваДоступаДляПараметровМониторинга.Группа = &Группа)
	               |ГДЕ
	               |	CW_ПараметрыГрузоперевозок.ЭтоГруппа = ЛОЖЬ
	               |	И CW_ПараметрыГрузоперевозок.Предопределенный = ЛОЖЬ
	               |	И ВЫБОР
	               |			КОГДА &УказанТипПеревозки
	               |				ТОГДА CW_ПараметрыГрузоперевозок.Ссылка В (&МассивПараметров)
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ.Параметр КАК Параметр,
	               |	ВТ.Идентификатор КАК Идентификатор,
	               |	ВТ.ТипЗначения КАК ТипЗначения
	               |ИЗ
	               |	ВТ КАК ВТ
	               |ГДЕ
	               |	ВТ.Просмотр = ИСТИНА";
		
	Запрос.УстановитьПараметр("Группа"				, ГруппаПользователя);
	Запрос.УстановитьПараметр("УказанТипПеревозки"	, ТипПеревозки <> Неопределено);
	Запрос.УстановитьПараметр("МассивПараметров"	, МассивПараметров);
	
	Выборка = Запрос.Выполнить().Выбрать();

	Возврат Выборка;

КонецФункции	

Функция ПолучитьКоличествоЗаказовПоЗаявке(Заявка) Экспорт
	
	Если Заявка.Пустая() Тогда
		Возврат 0;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ CW_Заказы.Ссылка) КАК Ссылка
	|ИЗ
	|	Справочник.CW_Заказы КАК CW_Заказы
	|ГДЕ
	|	CW_Заказы.Заявка = &Заявка";
	
	Запрос.УстановитьПараметр("Заявка", Заявка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Функция ПолучитьМассивЗаказовПоЗаявке(Заявка) Экспорт
	
	Если Заявка.Пустая() Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_Заказы.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_Заказы КАК CW_Заказы
	               |ГДЕ
	               |	CW_Заказы.Заявка = &Заявка";
	
	Запрос.УстановитьПараметр("Заявка", Заявка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьМассивГрузоперевозокЗаказа(Знач МассивЗаказов) экспорт
	
	Если ТипЗнч(МассивЗаказов) = Тип("СправочникСсылка.CW_Заказы") Тогда
		МассивЗаказов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(МассивЗаказов);
	КонецЕсли;
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_Грузоперевозки.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_Грузоперевозки КАК CW_Грузоперевозки
	               |ГДЕ
	               |	CW_Грузоперевозки.Заказ В(&МассивЗаказов)";
	Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьГрузоперевозки(ПараметрыПроцедуры, АдресРезультата=Неопределено) Экспорт
	
	Для Каждого ГрузоперевозкаСсылка из ПараметрыПроцедуры.МассивГрузоперевозок Цикл
		ГрузоперевозкаОбъект = ГрузоперевозкаСсылка.ПолучитьОбъект();
		ГрузоперевозкаОбъект.Заказ = ПараметрыПроцедуры.Заказ;
		ГрузоперевозкаОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

//КОПИРОВАНИЕ ГРУЗОПЕРЕВОЗОК ЗАКАЗА
Процедура ВыполнитьКопированиеГрузоперевозок(ПараметрыПроцедуры, АдресРезультата = Неопределено) Экспорт
	
	СозданныеГрузоперевозки = Новый Массив;  
	
	//Количество задано числом
	Если ТипЗнч(ПараметрыПроцедуры.Количество) = Тип("Число") тогда  
		Для Каждого ОбъектКопирования из  ПараметрыПроцедуры.МассивОбъектовКопирования Цикл
			ПредставлениеГрузоперевозки = ?(ПараметрыПроцедуры.ОчищатьПредставление, "" , СокрЛП(ОбъектКопирования.CW_Представление)); 
			Для Счетчик = 1 по ПараметрыПроцедуры.Количество Цикл
				НоваяГрузоперевозка = СоздатьНовуюГрузоперевозкуКЗаказуКопированием(ОбъектКопирования, ПараметрыПроцедуры, ПредставлениеГрузоперевозки);    
				СозданныеГрузоперевозки.Добавить(НоваяГрузоперевозка);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	//Количество задано список
	Если ТипЗнч(ПараметрыПроцедуры.Количество) = Тип("СписокЗначений") тогда
		Для Каждого ОбъектКопирования из  ПараметрыПроцедуры.МассивОбъектовКопирования Цикл
			Для Каждого ЭлементСписка из ПараметрыПроцедуры.Количество Цикл
				НоваяГрузоперевозка = СоздатьНовуюГрузоперевозкуКЗаказуКопированием(ОбъектКопирования, ПараметрыПроцедуры, ЭлементСписка.Значение);
				СозданныеГрузоперевозки.Добавить(НоваяГрузоперевозка);
			КонецЦикла;	
		КонецЦикла;
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(СозданныеГрузоперевозки, АдресРезультата);
	
КонецПроцедуры
 
Функция СоздатьНовуюГрузоперевозкуКЗаказуКопированием(Знач ОбъектКопирования, ПараметрыКопирования, Представление="");   
	
	НовыйТипПеревозки = ОбъектКопирования.ТипПеревозки; 
	Если ПараметрыКопирования.СпособУстановкиТипаПеревозки = 1 Тогда
		НовыйТипПеревозки = ПараметрыКопирования.НовыйТипПеревозки;
	КонецЕсли;
	
	ГрузоперевозкаОбъект = Справочники.CW_Грузоперевозки.СоздатьЭлемент();
	
	ЗаполнитьЗначенияСвойств(ГрузоперевозкаОбъект, ОбъектКопирования, ,"Владелец,Родитель,ОтслеживаемоеОборудование,Архив,ТипПеревозки,Код");  
	
	ГрузоперевозкаОбъект.ТипПеревозки = НовыйТипПеревозки; 
	
	Если ПараметрыКопирования.УстановитьТекущуюДатуГрузоперевозки Тогда
		ГрузоперевозкаОбъект.ДатаСделкиФ = ТекущаяДата();
	КонецЕсли;
	
	Если ПараметрыКопирования.ОчищатьСсылкуНаЗаказ Тогда
		ГрузоперевозкаОбъект.Заказ = Неопределено;
	КонецЕсли;
	
	Если ПараметрыКопирования.ОчищатьПредставление Тогда
		Представление = "";
	КонецЕсли;  
	
	ГрузоперевозкаОбъект.CW_Представление = Представление;   
	
	Если ПараметрыКопирования.СпособЗаполненияПараметровГрузоперевозкиПриКопировании = 0 Тогда  
		
		ПараметрыТипаПеревозки 			= НовыйТипПеревозки.ПараметрыГрузоперевозки.Выгрузить();
		ГруппыПараметровТипаПеревозки	= НовыйТипПеревозки.ГруппыПараметровГрузоперевозки.Выгрузить(); 
		
		Для Каждого СтрокаТаблицы из ПараметрыТипаПеревозки Цикл  
			
			НоваяСтрока = ГрузоперевозкаОбъект.ПараметрыГрузоперевозки.Добавить();
			
			ИсключаяСвойства = "";
			Если НоваяСтрока.Параметр.ОчищатьПриКопировании Тогда  
				ИсключаяСвойства = "Значение,ЗначениеПлан,ЗначениеФакт,Примечание";
			КонецЕсли;   
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы, , ИсключаяСвойства);  
			
			НайденнаяСтрока = ОбъектКопирования.ПараметрыГрузоперевозки.Найти(СтрокаТаблицы.Параметр, "Параметр");
			если НайденнаяСтрока <> Неопределено 
				и НЕ НоваяСтрока.Параметр.ОчищатьПриКопировании Тогда   
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, НайденнаяСтрока, , "Параметр,ИдентификаторВладельца"); 
				
				ХранилищеДанных =  НайденнаяСтрока.ХранилищеДанных.Получить();
				НоваяСтрока.ХранилищеДанных = Новый ХранилищеЗначения(ХранилищеДанных);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ГрузоперевозкаОбъект.ГруппыПараметровГрузоперевозки.Загрузить(ГруппыПараметровТипаПеревозки); 
		
	Иначе  
		
		Для Каждого СтрокаТаблицы из ОбъектКопирования.ПараметрыГрузоперевозки Цикл 
			Если СтрокаТаблицы.Параметр = ПланыВидовХарактеристик.CW_ПараметрыГрузоперевозок.Служебный Тогда                                     
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ГрузоперевозкаОбъект.ПараметрыГрузоперевозки.Добавить(); 
			
			ИсключаяСвойства = "";
			Если СтрокаТаблицы.Параметр.ОчищатьПриКопировании Тогда  
				ИсключаяСвойства = "Значение,ЗначениеПлан,ЗначениеФакт,Примечание";
			КонецЕсли;   
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы,, ИсключаяСвойства);  
			
			ХранилищеДанных =  СтрокаТаблицы.ХранилищеДанных.Получить();
			НоваяСтрока.ХранилищеДанных = Новый ХранилищеЗначения(ХранилищеДанных);
			
		КонецЦикла; 	
		
		//ГруппыПараметровГрузоперевозки
		ГруппыПараметровОбъектаКопирвоания 	= ОбъектКопирования.ГруппыПараметровГрузоперевозки.Выгрузить();
		ГрузоперевозкаОбъект.ГруппыПараметровГрузоперевозки.Загрузить(ГруппыПараметровОбъектаКопирвоания); 
		//ГруппыПараметровГрузоперевозки
		
	КонецЕсли; 
	
	//заполняем предопределенные  ОперативныйМенеджер

	МассивПроверяемыхРеквизитов = СтрРазделить("Клиент;Маршрут;ТипПеревозки;Груз;МенеджерПродаж;ОперативныйМенеджер;Типоразмер",";");
	Для каждого Реквизит Из МассивПроверяемыхРеквизитов Цикл
		ПП = CW_Мониторинг.ПолучитьПредопределенныеПараметры(ГрузоперевозкаОбъект[Реквизит], Реквизит);
		Если _УФКС.ВыполненоУспешно(ПП) Тогда
			CW_Мониторинг.ДобавитьПредопределенныеПараметры(ГрузоперевозкаОбъект, ПП.Параметры);
		КонецЕсли; 
	КонецЦикла; 
	
	Если ЗначениеЗаполнено(ГрузоперевозкаОбъект.ТипПеревозки) Тогда
		_УФС.ЗаполнитьПредопределенныеЗначенияРеквизитовШапки(ГрузоперевозкаОбъект, ГрузоперевозкаОбъект.ТипПеревозки, "ДляГрузоперевозки");
	КонецЕсли;
	//--заполняем предопределенные
	
	ГрузоперевозкаОбъект.Записать();
	
	//Запишем стутасы
	МассивСсылок = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ГрузоперевозкаОбъект.Ссылка);
	
	CW_ЛогистическиеСтатусыСервер.РассчитатьЛогистическийСтатус(МассивСсылок);
	CW_ФинансовыеСтатусыСервер.РассчитатьФинансовыйСтатус(МассивСсылок);
	//Запишем стутасы

	Если ПараметрыКопирования.ВерсииБюджетов.Количество() <> 0 Тогда
		CW_Бюджетирование.СкопироватьБюджеты(ОбъектКопирования, ГрузоперевозкаОбъект.Ссылка, ПараметрыКопирования.ВерсииБюджетов, Ложь);
	КонецЕсли; 

	Возврат ГрузоперевозкаОбъект.Ссылка;
			
КонецФункции
//КОПИРОВАНИЕ ГРУЗОПЕРЕВОЗОК ЗАКАЗА

//Шаблоны стандартных писем  
Процедура ДополнитьМакросыОбъекта(ДеревоМакросов) Экспорт
	
	ГруппаМакросов = ДеревоМакросов.Строки.Добавить();  
	ГруппаМакросов.ИндексКартинки 	= 0;
	ГруппаМакросов.Значение 		= "";
	ГруппаМакросов.Представление 	= "Заказ";
	ГруппаМакросов.ЭтоГруппа 		= Истина;
	
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[Заказ]", 				"Заказ",				4); 
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[Заявка]", 				"Заявка",				4); 
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[ДатаЗаказа]", 			"Дата заказа", 			2); 
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[ТипПеревозки]", 		"Тип перевозки",		4); 
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[Контрагент]", 			"Контрагент",			4); 
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[МенеджерПродаж]", 		"Менеджер продаж",		4); 
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[ОперативныйМенеджер]", "Оперативный менеджер",	4); 
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[Маршрут]", 			"Маршрут",				4); 
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[Груз]", 				"Груз",					4);  			

	ДобавитьСтрокуМакросов(ГруппаМакросов, "[СписокГрузоперевозок]","Список грузоперевозок",9); 
	
	Если ПолучитьФункциональнуюОпцию("CW_ИспользуютсяПараметрыВЗаказах") Тогда
		ГруппаПараметров = ГруппаМакросов.Строки.Добавить();  
		ГруппаПараметров.ИндексКартинки = 0;
		ГруппаПараметров.Значение 		= "";
		ГруппаПараметров.Представление 	= "Параметры";
		ГруппаПараметров.ЭтоГруппа 		= Истина;
		
		ПланыВидовХарактеристик.CW_ПараметрыГрузоперевозок.ДополнитьМакросыПараметровГрузоперевозок(ГруппаПараметров);
	КонецЕсли;
	
КонецПроцедуры 

Процедура ДобавитьСтрокуМакросов(ГруппаМакросов, Значение, Представление, ИндексКартинки)
	
	СтрокаМакроса = ГруппаМакросов.Строки.Добавить();
	СтрокаМакроса.ИндексКартинки 	= ИндексКартинки;
	СтрокаМакроса.Значение 			= Значение;
	СтрокаМакроса.Представление 	= Представление;
	СтрокаМакроса.ЭтоГруппа 		= Ложь;
	
КонецПроцедуры

Процедура ПолучитьОписаниеМакросов(Результат, ДополнительныеПараметры=Неопределено) Экспорт
	
	Результат.Вставить("[Заказ]", 				"Источник");
	Результат.Вставить("[Заявка]", 				"Источник.Заявка");
	Результат.Вставить("[ДатаЗаказа]", 			"Источник.ДатаСделкиФ");
	Результат.Вставить("[Контрагент]", 			"Источник.Клиент");
	Результат.Вставить("[ТипПеревозки]", 		"Источник.ТипПеревозки");
	Результат.Вставить("[МенеджерПродаж]", 		"Источник.МенеджерПродаж");
	Результат.Вставить("[Маршрут]",				"Источник.Маршрут");
	Результат.Вставить("[Груз]",				"Источник.Груз");
	Результат.Вставить("[СписокГрузоперевозок]","МенеджерОбъектаШаблона.ПолучитьСписокГрузоперевозок(Источник)");
	
	Результат.Вставить("[ФИООтправителя]", 		"CW_Печать.ФамилияИОИзСтрокиФамилияИмяОтчество(НастройкиПользователя.ФИО, Источник.ДатаСделкиФ)");
	
	Если ПолучитьФункциональнуюОпцию("CW_ИспользуютсяПараметрыВЗаказах") Тогда
		ПланыВидовХарактеристик.CW_ПараметрыГрузоперевозок.ОписаниеМакросовПараметровГрузоперевозок(Результат);
	КонецЕсли;
	
КонецПроцедуры  

Функция ПолучитьСписокГрузоперевозок(Источник) Экспорт
	
	Массив = ПолучитьМассивГрузоперевозокЗаказа(Источник);
	
	Возврат СтрСоединить(Массив, ", ");
	
КонецФункции

Функция ПолучитьЗначениеПараметра(Источник, ИдентификаторПараметра,  ПолучаемоеЗначение = "Значение", СоответствиеПараметров) Экспорт
	
	Параметр = СоответствиеПараметров.Получить(ИдентификаторПараметра);
	Если Параметр = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ХарактеристикиЗаказов.Значение КАК Значение,
	|	CW_ХарактеристикиЗаказов.ЗначениеПлан КАК ЗначениеПлан,
	|	CW_ХарактеристикиЗаказов.ЗначениеФакт КАК ЗначениеФакт
	|ИЗ
	|	РегистрСведений.CW_ХарактеристикиЗаказов КАК CW_ХарактеристикиЗаказов
	|ГДЕ
	|	CW_ХарактеристикиЗаказов.Заказ = &Заказ
	|И 	CW_ХарактеристикиЗаказов.Параметр = &Параметр";
	
	Запрос.УстановитьПараметр("Заказ",		Источник);
	Запрос.УстановитьПараметр("Параметр",	Параметр);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ЗначениеПараметра = Выборка[ПолучаемоеЗначение];
	КонецЕсли;
	
	Возврат ЗначениеПараметра;

КонецФункции

//---Шаблоны стандартных писем 

#КонецЕсли
